# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CitySet..::..Contains Method
CitySet Class See Also
---
Tests for the existence of a city within the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	City item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As City _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	City^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..CityThe city to be searched for.
# ### Return Value
The Contains method returns True if the city is within the set, otherwise False.
# See Also
CitySet Class
Autodesk.Revit.DB Namespace